app/controllers/reserva_salas_controller.rb

SELECT "reserva_salas".* FROM "reserva_salas"
---
  def index
    @reserva_salas = ReservaSala.all

INSERT INTO "reserva_salas" ("created_at", "reserva_id", "sala_id", "updated_at") VALUES (?, ?, ?, ?)  [["created_at", "2015-11-04 22:25:20.813786"], ["reserva_id", 1], ["sala_id", 1], ["updated_at", "2015-11-04 22:25:20.813786"]]
---
  def create
    @reserva_sala = ReservaSala.new(reserva_sala_params)
    @reserva_sala.save

UPDATE "reserva_salas" SET "sala_id" = ?, "updated_at" = ? WHERE "reserva_salas"."id" = 1  [["sala_id", 0], ["updated_at", "2015-11-11 23:03:02.255423"]]
---
  def update
    @reserva_sala.update(reserva_sala_params)

SELECT  "reserva_salas".* FROM "reserva_salas"  WHERE "reserva_salas"."id" = ? LIMIT 1  [["id", 1]]
SELECT  "salas".* FROM "salas"  WHERE "salas"."id" = ? LIMIT 1  [["id", 1]]
---
    def set_reserva_sala
      @reserva_sala = ReservaSala.find(params[:id])