app/controllers/reservas_controller.rb

  def index
    @reservas = Reserva.all
---
SELECT "reservas".* FROM "reservas"

  def create
    @reserva = Reserva.new(reserva_params)
    @reserva.save
---
INSERT INTO "reservas" ("created_at", "dia", "hora", "updated_at") VALUES (?, ?, ?, ?)  [["created_at", "2015-11-03 23:01:48.291522"], ["dia", "2015-11-03"], ["hora", 2], ["updated_at", "2015-11-03 23:01:48.291522"]]

  def update
    @reserva.update(reserva_params)
---
UPDATE "reservas" SET "dia" = ?, "updated_at" = ? WHERE "reservas"."id" = 2  [["dia", "2015-11-04"], ["updated_at", "2015-11-11 22:56:28.090534"]]

    def set_reserva
      @reserva = Reserva.find(params[:id])
---
SELECT  "reservas".* FROM "reservas"  WHERE "reservas"."id" = ? LIMIT 1  [["id", 1]]