app/controllers/salas_controller.rb

SELECT "salas".* FROM "salas"
---
  def index
    @salas = Sala.all

UPDATE "salas" SET "salaFull" = ?, "updated_at" = ? WHERE "salas"."id" = 1  [["salaFull", "equipada con sonido completo linea mas sonido de microfonos para vientos"], ["updated_at", "2015-11-04 22:43:50.991656"]]
---
  def update
    @sala.update(sala_params)

SELECT "reservas".* FROM "reservas" INNER JOIN "reserva_salas" ON "reservas"."id" = "reserva_salas"."reserva_id" WHERE "reserva_salas"."sala_id" = ?  [["sala_id", 1]]
---
  def show
    @reservas = @sala.reserva.all

SELECT  "salas".* FROM "salas"  WHERE "salas"."id" = ? LIMIT 1  [["id", 3]]
---
    def set_sala
      @sala = Sala.find(params[:id])